In [1]:
##read csv, make dataframe, get data set csvs for population density / general wealth level, make dataframes/lists, graph, profit

In [2]:
print("Easy peasy lemon squeezy.")

Easy peasy lemon squeezy.

In [35]:
#import
import os
import pandas as pd
import numpy as np
import json
import matplotlib
from pprint import pprint
from citipy import citipy
from scipy import stats

In [36]:
#filepath and read_csv
#dataframe.head()

# File to Load (Remember to Change These)
uber_sep14 = "../uber-data/uber-raw-data-sep14.csv"
uber_jul14 = "../uber-data/uber-raw-data-jul14.csv"
uber_apr14 = "../uber-data/uber-raw-data-apr14.csv"


# Read Purchasing File and store into Pandas data frame
fall_df = pd.read_csv(uber_sep14)
summer_df = pd.read_csv(uber_jul14)
spring_df = pd.read_csv(uber_apr14)

In [63]:
uber_janfeb = "../uber-data/Uber-Jan-Feb-FOIL.csv"
twofer_df = pd.read_csv(uber_janfeb)
twofer_df

    dispatching_base_number       date  active_vehicles  trips
0                    B02512   1/1/2015              190   1132
1                    B02765   1/1/2015              225   1765
2                    B02764   1/1/2015             3427  29421
3                    B02682   1/1/2015              945   7679
4                    B02617   1/1/2015             1228   9537
..                      ...        ...              ...    ...
349                  B02764  2/28/2015             3952  39812
350                  B02617  2/28/2015             1372  14022
351                  B02682  2/28/2015             1386  14472
352                  B02512  2/28/2015              230   1803
353                  B02765  2/28/2015              747   7753

[354 rows x 4 columns]

In [64]:
jan_df = twofer_df.truncate(after = 185)
jan_df

    dispatching_base_number       date  active_vehicles  trips
0                    B02512   1/1/2015              190   1132
1                    B02765   1/1/2015              225   1765
2                    B02764   1/1/2015             3427  29421
3                    B02682   1/1/2015              945   7679
4                    B02617   1/1/2015             1228   9537
..                      ...        ...              ...    ...
181                  B02512  1/31/2015              225   1892
182                  B02617  1/31/2015             1394  15756
183                  B02682  1/31/2015             1321  15388
184                  B02764  1/31/2015             3947  44297
185                  B02598  1/31/2015             1027  11642

[186 rows x 4 columns]

In [76]:
#jan_df.date.value_counts() # -> to do this you'd need to groupby(date).trips.count()
winterdates = jan_df.groupby("date").trips.sum()
#jandates = jandates.sort_values(axis = 0, ascending = True)

winterdates_df = pd.DataFrame(winterdates)
winterdates_df = winterdates_df.sort_values(by = "date", axis = 0, ascending = True)
winterdates_df
#jan_df.trips.sum()

           trips
date
1/1/2015   56437
1/10/2015  78484
1/11/2015  57026
1/12/2015  57646
1/13/2015  63499
1/14/2015  63329
1/15/2015  66729
1/16/2015  72480
1/17/2015  73363
1/18/2015  72473
1/19/2015  45755
1/2/2015   39189
1/20/2015  54772
1/21/2015  59147
1/22/2015  65602
1/23/2015  71819
1/24/2015  80709
1/25/2015  57895
1/26/2015  43395
1/27/2015  25244
1/28/2015  60446
1/29/2015  68994
1/3/2015   58449
1/30/2015  83723
1/31/2015  92257
1/4/2015   40798
1/5/2015   42752
1/6/2015   52426
1/7/2015   62102
1/8/2015   71413
1/9/2015   70296

In [41]:
#pharma_data = pharma_data[~pharma_data["Mouse ID"].isin([bad_mouse])]
#pharma_data
jan_df = jan_df.loc[~jan_df["dispatching_base_number"].isin(["B02765"])]
jan_df.dispatching_base_number.value_counts()

B02617    31
B02682    31
B02598    31
B02512    31
B02764    31
Name: dispatching_base_number, dtype: int64

In [13]:
fall_df

                  Date/Time      Lat      Lon    Base
0          9/1/2014 0:01:00  40.2201 -74.0021  B02512
1          9/1/2014 0:01:00  40.7500 -74.0027  B02512
2          9/1/2014 0:03:00  40.7559 -73.9864  B02512
3          9/1/2014 0:06:00  40.7450 -73.9889  B02512
4          9/1/2014 0:11:00  40.8145 -73.9444  B02512
...                     ...      ...      ...     ...
1028131  9/30/2014 22:57:00  40.7668 -73.9845  B02764
1028132  9/30/2014 22:57:00  40.6911 -74.1773  B02764
1028133  9/30/2014 22:58:00  40.8519 -73.9319  B02764
1028134  9/30/2014 22:58:00  40.7081 -74.0066  B02764
1028135  9/30/2014 22:58:00  40.7140 -73.9496  B02764

[1028136 rows x 4 columns]

In [74]:
fall_df['Date'] = ""
fall_df['Time'] = ""
fall_df[['Date','Time']] = fall_df["Date/Time"].str.split(" ",expand=True)

falldates = fall_df.groupby("Date").Lat.count()
falldates_df = pd.DataFrame(falldates)
falldates_df

             Lat
Date
9/1/2014   19961
9/10/2014  35910
9/11/2014  36439
9/12/2014  39540
9/13/2014  43205
9/14/2014  28122
9/15/2014  29454
9/16/2014  36092
9/17/2014  35531
9/18/2014  40274
9/19/2014  41017
9/2/2014   28831
9/20/2014  38864
9/21/2014  28620
9/22/2014  28312
9/23/2014  30316
9/24/2014  31301
9/25/2014  38203
9/26/2014  37504
9/27/2014  39468
9/28/2014  29656
9/29/2014  29201
9/3/2014   32631
9/30/2014  33431
9/4/2014   38360
9/5/2014   42319
9/6/2014   40520
9/7/2014   30134
9/8/2014   30360
9/9/2014   34560

In [14]:
spring_df

                 Date/Time      Lat      Lon    Base
0         4/1/2014 0:11:00  40.7690 -73.9549  B02512
1         4/1/2014 0:17:00  40.7267 -74.0345  B02512
2         4/1/2014 0:21:00  40.7316 -73.9873  B02512
3         4/1/2014 0:28:00  40.7588 -73.9776  B02512
4         4/1/2014 0:33:00  40.7594 -73.9722  B02512
...                    ...      ...      ...     ...
564511  4/30/2014 23:22:00  40.7640 -73.9744  B02764
564512  4/30/2014 23:26:00  40.7629 -73.9672  B02764
564513  4/30/2014 23:31:00  40.7443 -73.9889  B02764
564514  4/30/2014 23:32:00  40.6756 -73.9405  B02764
564515  4/30/2014 23:48:00  40.6880 -73.9608  B02764

[564516 rows x 4 columns]

In [75]:
spring_df['Date'] = ""
spring_df['Time'] = ""
spring_df[['Date','Time']] = spring_df["Date/Time"].str.split(" ",expand=True)

springdates = spring_df.groupby("Date").Lat.count()
springdates_df = pd.DataFrame(springdates)
springdates_df

             Lat
Date
4/1/2014   14546
4/10/2014  20041
4/11/2014  20420
4/12/2014  18170
4/13/2014  12112
4/14/2014  12674
4/15/2014  20641
4/16/2014  17717
4/17/2014  20973
4/18/2014  18074
4/19/2014  14602
4/2/2014   17474
4/20/2014  11017
4/21/2014  13162
4/22/2014  16975
4/23/2014  20346
4/24/2014  23352
4/25/2014  25095
4/26/2014  24925
4/27/2014  14677
4/28/2014  15475
4/29/2014  22835
4/3/2014   20701
4/30/2014  36251
4/4/2014   26714
4/5/2014   19521
4/6/2014   13445
4/7/2014   19550
4/8/2014   16188
4/9/2014   16843

In [15]:
summer_df

                 Date/Time      Lat      Lon    Base
0         7/1/2014 0:03:00  40.7586 -73.9706  B02512
1         7/1/2014 0:05:00  40.7605 -73.9994  B02512
2         7/1/2014 0:06:00  40.7320 -73.9999  B02512
3         7/1/2014 0:09:00  40.7635 -73.9793  B02512
4         7/1/2014 0:20:00  40.7204 -74.0047  B02512
...                    ...      ...      ...     ...
796116  7/31/2014 23:22:00  40.7285 -73.9846  B02764
796117  7/31/2014 23:23:00  40.7615 -73.9868  B02764
796118  7/31/2014 23:29:00  40.6770 -73.9515  B02764
796119  7/31/2014 23:30:00  40.7225 -74.0038  B02764
796120  7/31/2014 23:58:00  40.7199 -73.9884  B02764

[796121 rows x 4 columns]

In [73]:
summer_df['Date'] = ""
summer_df['Time'] = ""
summer_df[['Date','Time']] = summer_df["Date/Time"].str.split(" ",expand=True)

summerdates = summer_df.groupby("Date").Lat.count()
summerdates_df = pd.DataFrame(summerdates)
summerdates_df

             Lat
Date
7/1/2014   21228
7/10/2014  30541
7/11/2014  28752
7/12/2014  25936
7/13/2014  21082
7/14/2014  27350
7/15/2014  33845
7/16/2014  28607
7/17/2014  30710
7/18/2014  29860
7/19/2014  25726
7/2/2014   26480
7/20/2014  21212
7/21/2014  23578
7/22/2014  29029
7/23/2014  34073
7/24/2014  32050
7/25/2014  29975
7/26/2014  27708
7/27/2014  22590
7/28/2014  23981
7/29/2014  27589
7/3/2014   21597
7/30/2014  30740
7/31/2014  33541
7/4/2014   14148
7/5/2014   10890
7/6/2014   11443
7/7/2014   18280
7/8/2014   25763
7/9/2014   27817

In [ ]:
#Once the above are working, You can